nr_dci.org
#+TITLE: NR - DCI

* Introduction
In NR system, the /downlink control information (DCI)/ is carried by physical downlink control channel (PDCCH), which physically occupied a region in the 2-dimension resource grid, which is essentially comprised of a certain number of resource elements (RE's), a.k.a., /control resource set (CORESET)/. Different from the counterpart in LTE, i.e., PDCCH region which always covers the whole frequency range, CORESET does not span the whole bandwidth, since the bandwidth in NR system is remarkably large while not all the NR UE's are able to perform reception over the whole bandwidth.

Due to the static feature of CORESET, the indication of its size is not necessary. Therefore, there is no PCFICH in NR system. Additionally, irrespective of downlink or uplink, asynchronous HARQ is utilized in NR. Hence, PHICH is not needed either.

In NR, the channel coding scheme for PDCCH is based on /polar codes/. It can support 512 coded bits (prior to rate matching[fn:1]) and up to 140 information bits. Targetting an enhanced coverage, a beamformed single layer transmission is adopted for PDCCH. In this sense, it is similar to ePDCCH in LTE system.
* Resource hierarchy
Just as its name indicates, the basic element for PDCCH is /control channel element (CCE)/, which is comprised of 6 /resource element groups (REG's)/, and a REG is defined as one resource block (RB) in one OFDM symbol[fn:2]. An /aggregation level/ number of CCE's forms one PDCCH. The value of aggregation level can be 1, 2, 4, 8, 16[fn:4].
** CORESET
A CORESET is essentially a time-frequency resource in which the UE tries to decode candidate control channels using one or more search spaces. For the sake of reuse between bandwidth parts (BWP's), a CORESET is per-cell other than per-BWP configured.

A CORESET can occur at any position within a slot and any frequency range of the carrier. In the time domain, it can be up to 3 OFDM symbols. While in the frequency domain, it is defined as a multiple of 6 RB's up to the whole bandwidth of a carrier.

For better spectral efficiency, the resources in a CORESET can be dynamically used for PDSCH transmission. To this end, whether the reserved resources are available for PDSCH is dynamically indicated in the DCI.

Particularly, the first CORESET, i.e., CORESET 0, is configured by master information block (MIB) in PBCH. After connection setup, a UE can be configured with a multiplicity of potentially overlapped CORESET's.

Each CORESET can be configured with a /transmission configuration indication (TCI)/, which indicates the quasi-colocation (QCL) relationship of the PDCCH.
** CCE-to-REG mapping
CCE-to-REG mapping is per-CORESET configured. Generally, there are a couple of CCE-to-REG mapping schemes, interleaved and non-interleaved. The former targets frequency diversity, while the latter aims to facilitate interference coordination and opportunistic scheduling.

A set of REG's which share the same precoding are termed one /REG bundle/. Namely, a REG bundle is the basic unit on which channel estimation is performed. All the possible cases can be listed in the table below.
|              <c>               |             <c>              |        <c>        |
|--------------------------------+------------------------------+-------------------|
| CORESET duration (OFDM symbol) | REG bundle size (REG number) | REG bundle number |
|--------------------------------+------------------------------+-------------------|
|               1                |              6               |         1         |
|                                |              2               |         3         |
|--------------------------------+------------------------------+-------------------|
|               2                |              6               |         1         |
|                                |              2               |         3         |
|--------------------------------+------------------------------+-------------------|
|               3                |              6               |         1         |
|                                |              3               |         2         |
|--------------------------------+------------------------------+-------------------|
** Search space
As in LTE system, a NR UE also needs to blindly detect the DCI format[fn:3]. A UE needs to monitor up to 4 different DCI sizes with 3 using C-RNTI and 1 using other RNTI's:
- One size for fallback DCI formats,
- One size for downlink scheduling assignments,
- One size for uplink scheduling grants,
- One size for slot-format indication and preemption indication.

A UE attempts to blindly decode a DCI based on /search space/, which is defined as a set of control channel candidates formed by a given aggregation level number of CCE's. To limit the complexity of blind DCI decoding, several constraints depending on the subcarrier bandwidth have been specified, e.g.,
- For 15/30/60/120 kHz subcarrier bandwidth, up to 44/36/22/20 blind decoding attempts can be supported across all DCI payload sizes in one slot.
- For 15/30/60/120 kHz subcarrier bandwidth, up to 56/56/48/32 CCE's on which channel estimation is performed can be supportd across all CORESET's in a slot.
* DCI formats
