nr_dci.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-01-22 Wed 00:03 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>NR - DCI</title>
<meta name="generator" content="Org mode">
<meta name="author" content="shaka">
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">NR - DCI</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9e12007">Introduction</a></li>
<li><a href="#org6782339">Resource hierarchy</a>
<ul>
<li><a href="#org93b0262">CORESET</a></li>
<li><a href="#orgd1077b3">CCE-to-REG mapping</a></li>
<li><a href="#orgfd0d6f7">Search space</a></li>
</ul>
</li>
<li><a href="#orgd05c3e2">DCI formats</a>
<ul>
<li><a href="#org491edcd">Downlink scheduling assignments (DCI formats 1-0 and 1-1)</a></li>
<li><a href="#orgf3cf749">Uplink scheduling grants (DCI formats 0-0 and 0-1)</a></li>
<li><a href="#org4287975">Slot format indication (DCI format 2-0)</a></li>
<li><a href="#orgf5d2639">Preemption indication (DCI format 2-1)</a></li>
<li><a href="#orge3f4adc">Uplink power control commands (DCI format 2-2)</a></li>
<li><a href="#org4a092c3">SRS control commands (DCI format 2-3)</a></li>
</ul>
</li>
<li><a href="#org7fd8ede">Signalling of frequency domain resources</a></li>
<li><a href="#orgcd995d8">Signalling of time domain resources</a></li>
<li><a href="#org537a19b">Signalling of TB size</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9e12007" class="outline-2">
<h2 id="org9e12007">Introduction</h2>
<div class="outline-text-2" id="text-org9e12007">
<p>
In NR system, the <i>downlink control information (DCI)</i> is carried by physical downlink control channel (PDCCH), which physically occupied a region in the 2-dimension resource grid, which is essentially comprised of a certain number of resource elements (RE's), a.k.a., <i>control resource set (CORESET)</i>. Different from the counterpart in LTE, i.e., PDCCH region which always covers the whole frequency range, CORESET does not span the whole bandwidth, since the bandwidth in NR system is remarkably large while not all the NR UE's are able to perform reception over the whole bandwidth.
</p>

<p>
Due to the static feature of CORESET, the indication of its size is not necessary. Therefore, there is no PCFICH in NR system. Additionally, irrespective of downlink or uplink, asynchronous HARQ is utilized in NR. Hence, PHICH is not needed either.
</p>

<p>
In NR, the channel coding scheme for PDCCH is based on <i>polar codes</i>. It can support 512 coded bits (prior to rate matching<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>) and up to 140 information bits. Targetting an enhanced coverage, a beamformed single layer transmission is adopted for PDCCH. In this sense, it is similar to ePDCCH in LTE system.
</p>
</div>
</div>
<div id="outline-container-org6782339" class="outline-2">
<h2 id="org6782339">Resource hierarchy</h2>
<div class="outline-text-2" id="text-org6782339">
<p>
Just as its name indicates, the basic element for PDCCH is <i>control channel element (CCE)</i>, which is comprised of 6 <i>resource element groups (REG's)</i>, and a REG is defined as one resource block (RB) in one OFDM symbol<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. An <i>aggregation level</i> number of CCE's forms one PDCCH. The value of aggregation level can be 1, 2, 4, 8, 16<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>.
</p>
</div>
<div id="outline-container-org93b0262" class="outline-3">
<h3 id="org93b0262">CORESET</h3>
<div class="outline-text-3" id="text-org93b0262">
<p>
A CORESET is essentially a time-frequency resource in which the UE tries to decode candidate control channels using one or more search spaces. For the sake of reuse between bandwidth parts (BWP's), a CORESET is per-cell other than per-BWP configured.
</p>

<p>
A CORESET can occur at any position within a slot and any frequency range of the carrier. In the time domain, it can be up to 3 OFDM symbols. While in the frequency domain, it is defined as a multiple of 6 RB's up to the whole bandwidth of a carrier.
</p>

<p>
For better spectral efficiency, the resources in a CORESET can be dynamically used for PDSCH transmission. To this end, whether the reserved resources are available for PDSCH is dynamically indicated in the DCI.
</p>

<p>
Particularly, the first CORESET, i.e., CORESET 0, is configured by master information block (MIB) in PBCH. After connection setup, a UE can be configured with a multiplicity of potentially overlapped CORESET's.
</p>

<p>
Each CORESET can be configured with a <i>transmission configuration indication (TCI)</i>, which indicates the quasi-colocation (QCL) relationship of the PDCCH.
</p>
</div>
</div>
<div id="outline-container-orgd1077b3" class="outline-3">
<h3 id="orgd1077b3">CCE-to-REG mapping</h3>
<div class="outline-text-3" id="text-orgd1077b3">
<p>
CCE-to-REG mapping is per-CORESET configured. Generally, there are a couple of CCE-to-REG mapping schemes, interleaved and non-interleaved. The former targets frequency diversity, while the latter aims to facilitate interference coordination and opportunistic scheduling.
</p>

<p>
A set of REG's which share the same precoding are termed one <i>REG bundle</i>. Namely, a REG bundle is the basic unit on which channel estimation is performed. All the possible cases can be listed in the table below.
</p>
<table>


<colgroup>
<col  class="org-center">

<col  class="org-center">

<col  class="org-center">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-center">CORESET duration (OFDM symbol)</th>
<th scope="col" class="org-center">REG bundle size (REG number)</th>
<th scope="col" class="org-center">REG bundle number</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-center">1</td>
<td class="org-center">6</td>
<td class="org-center">1</td>
</tr>

<tr>
<td class="org-center">&#xa0;</td>
<td class="org-center">2</td>
<td class="org-center">3</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-center">2</td>
<td class="org-center">6</td>
<td class="org-center">1</td>
</tr>

<tr>
<td class="org-center">&#xa0;</td>
<td class="org-center">2</td>
<td class="org-center">3</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-center">3</td>
<td class="org-center">6</td>
<td class="org-center">1</td>
</tr>

<tr>
<td class="org-center">&#xa0;</td>
<td class="org-center">3</td>
<td class="org-center">2</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgfd0d6f7" class="outline-3">
<h3 id="orgfd0d6f7">Search space</h3>
<div class="outline-text-3" id="text-orgfd0d6f7">
<p>
As in LTE system, a NR UE also needs to blindly detect the DCI format<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>. A UE needs to monitor up to 4 different DCI sizes with 3 using C-RNTI and 1 using other RNTI's:
</p>
<ul class="org-ul">
<li>One size for fallback DCI formats,</li>
<li>One size for downlink scheduling assignments,</li>
<li>One size for uplink scheduling grants,</li>
<li>One size for slot-format indication and preemption indication.</li>
</ul>

<p>
A UE attempts to blindly decode a DCI based on <i>search space</i>, which is defined as a set of control channel candidates formed by a given aggregation level number of CCE's. To limit the complexity of blind DCI decoding, several constraints depending on the subcarrier bandwidth have been specified, e.g.,
</p>
<ul class="org-ul">
<li>For 15/30/60/120 kHz subcarrier bandwidth, up to 44/36/22/20 blind decoding attempts can be supported across all DCI payload sizes in one slot.</li>
<li>For 15/30/60/120 kHz subcarrier bandwidth, up to 56/56/48/32 CCE's on which channel estimation is performed can be supportd across all CORESET's in a slot.</li>
</ul>
</div>
</div>
</div>
