nr_dci.org
** Downlink scheduling assignments (DCI formats 1-0 and 1-1)
In NR, there are a couple of DCI formats for downlink scheduling assignments, the non-fallback format, i.e., DCI format 1-1, and the fallback format, i.e., DCI format 1-0. The former supports all NR features, whose size is variable since some information fields may be absent, which depends on whether the corresponding features are configured or not. The latter supports a limited set of NR functionalities with a fixed size.
| <l>                          | <l>                                            | <l>                                           | <l>                  |
| Class                        | Field                                          | Format 1-0 (bits)                             | Format 1-1 (bits)    |
|------------------------------+------------------------------------------------+-----------------------------------------------+----------------------|
| Format identifier            |                                                | 1                                             | 1                    |
| Resource related             | CFI                                            | 0                                             | 0, 3[fn:5]           |
|                              | BWP indicator                                  | 0                                             | 0-2[fn:6]            |
|                              | Frequency domain allocation[fn:9]              | Only type 1 resource allocation is supported. |                      |
|                              | Time domain allocation                         | 1-4                                           | 1-4                  |
|                              | VRB-to-PRB mapping[fn:8]                       | 0, 1                                          | 0, 1                 |
|                              | PRB bundling size indicator                    | 0, 1                                          | 0, 1                 |
|                              | Reserved resources[fn:7]                       | 0-2                                           | 0-2                  |
|                              | ZP CSI-RS trigger                              | 0                                             | 0-2                  |
| Transport block (TB) related | MCS                                            | 5                                             | 5, 10[fn:10]         |
|                              | New data indicator (NDI)                       | 1                                             | 1, 2                 |
|                              | Redundancy version (RV)                        | 2                                             | 2, 4                 |
| HARQ related                 | Process number                                 | 4                                             | 4                    |
|                              | Downlink assignment index (DAI)                | 2                                             | 0, 2, 4              |
|                              | HARQ feedback timing[fn:11]                    | 3                                             | 3                    |
|                              | Codeblock group transmission indicator (CBGTI) | 0                                             | 0, 2, 4, 6, 8[fn:12] |
|                              | Codeblock group flush information (CBGFI)      | 0                                             | 0-1[fn:12]           |
| Multi-antenna related        | Antenna ports                                  | 0                                             | 4-6                  |
|                              | Transmission configuration indication (TCI)    | 0                                             | 0, 3[fn:14]          |
|                              | SRS request                                    | 0                                             | 2[fn:16]             |
|                              | DMRS sequence initialization                   | 0                                             | 0, 1[fn:15]          |
| PUCCH-related                | PUCCH power control[fn:17]                     | 2                                             | 2                    |
|                              | PUCCH resource indicator (PRI)[fn:18]          | 3                                             | 3                    |
