nr_dci.html
<div id="outline-container-orgd05c3e2" class="outline-2">
<h2 id="orgd05c3e2">DCI formats</h2>
<div class="outline-text-2" id="text-orgd05c3e2">
</div>
<div id="outline-container-org491edcd" class="outline-3">
<h3 id="org491edcd">Downlink scheduling assignments (DCI formats 1-0 and 1-1)</h3>
<div class="outline-text-3" id="text-org491edcd">
<p>
In NR, there are a couple of DCI formats for downlink scheduling assignments, the non-fallback format, i.e., DCI format 1-1, and the fallback format, i.e., DCI format 1-0. The former supports all NR features, whose size is variable since some information fields may be absent, which depends on whether the corresponding features are configured or not. The latter supports a limited set of NR functionalities with a fixed size.
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Class</th>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">Format 1-0 (bits)</th>
<th scope="col" class="org-left">Format 1-1 (bits)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Format identifier</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1</td>
<td class="org-left">1</td>
</tr>

<tr>
<td class="org-left">Resource related</td>
<td class="org-left">CFI</td>
<td class="org-left">0</td>
<td class="org-left">0, 3<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">BWP indicator</td>
<td class="org-left">0</td>
<td class="org-left">0-2<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Frequency domain allocation<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup></td>
<td class="org-left">Only type 1 resource allocation is supported.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Time domain allocation</td>
<td class="org-left">1-4</td>
<td class="org-left">1-4</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">VRB-to-PRB mapping<sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup></td>
<td class="org-left">0, 1</td>
<td class="org-left">0, 1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">PRB bundling size indicator</td>
<td class="org-left">0, 1</td>
<td class="org-left">0, 1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Reserved resources<sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup></td>
<td class="org-left">0-2</td>
<td class="org-left">0-2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">ZP CSI-RS trigger</td>
<td class="org-left">0</td>
<td class="org-left">0-2</td>
</tr>

<tr>
<td class="org-left">Transport block (TB) related</td>
<td class="org-left">MCS</td>
<td class="org-left">5</td>
<td class="org-left">5, 10<sup><a id="fnr.10" class="footref" href="#fn.10">10</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">New data indicator (NDI)</td>
<td class="org-left">1</td>
<td class="org-left">1, 2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Redundancy version (RV)</td>
<td class="org-left">2</td>
<td class="org-left">2, 4</td>
</tr>

<tr>
<td class="org-left">HARQ related</td>
<td class="org-left">Process number</td>
<td class="org-left">4</td>
<td class="org-left">4</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Downlink assignment index (DAI)</td>
<td class="org-left">2</td>
<td class="org-left">0, 2, 4</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">HARQ feedback timing<sup><a id="fnr.11" class="footref" href="#fn.11">11</a></sup></td>
<td class="org-left">3</td>
<td class="org-left">3</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Codeblock group transmission indicator (CBGTI)</td>
<td class="org-left">0</td>
<td class="org-left">0, 2, 4, 6, 8<sup><a id="fnr.12" class="footref" href="#fn.12">12</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Codeblock group flush information (CBGFI)</td>
<td class="org-left">0</td>
<td class="org-left">0-1<sup><a id="fnr.12.100" class="footref" href="#fn.12">12</a></sup></td>
</tr>

<tr>
<td class="org-left">Multi-antenna related</td>
<td class="org-left">Antenna ports</td>
<td class="org-left">0</td>
<td class="org-left">4-6</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Transmission configuration indication (TCI)</td>
<td class="org-left">0</td>
<td class="org-left">0, 3<sup><a id="fnr.13" class="footref" href="#fn.13">13</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">SRS request</td>
<td class="org-left">0</td>
<td class="org-left">2<sup><a id="fnr.14" class="footref" href="#fn.14">14</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">DMRS sequence initialization</td>
<td class="org-left">0</td>
<td class="org-left">0, 1<sup><a id="fnr.15" class="footref" href="#fn.15">15</a></sup></td>
</tr>

<tr>
<td class="org-left">PUCCH-related</td>
<td class="org-left">PUCCH power control<sup><a id="fnr.16" class="footref" href="#fn.16">16</a></sup></td>
<td class="org-left">2</td>
<td class="org-left">2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">PUCCH resource indicator (PRI)<sup><a id="fnr.17" class="footref" href="#fn.17">17</a></sup></td>
<td class="org-left">3</td>
<td class="org-left">3</td>
</tr>
</tbody>
</table>
</div>
</div>
