nr_dci.org
** Uplink scheduling grants (DCI formats 0-0 and 0-1)
Similar to downlink scheduling assignments, uplink scheduling grants also use one of DCI formats, the non-fallback format, i.e., DCI format 0-1, and the fallback format, i.e., DCI format 0-0. Aiming to reduce the number of blind decoding, the non-fallback DCI formats for downlink scheduling assignments (format 1-1) and uplink scheduling grants (format 0-1) are aligned by padding to the smaller one.
| <l>                   | <l>                                 | <l>                                           | <l>                                              |
| Class                 | Field                               | Format 0-0 (bits)                             | Format 0-1 (bits)                                |
|-----------------------+-------------------------------------+-----------------------------------------------+--------------------------------------------------|
| Format identifier     |                                     | 1                                             | 1                                                |
| Resource related      | CFI                                 | 0                                             | 0, 3[fn:5]                                       |
|                       | UL/SUL[fn:20]                       | 0, 1                                          | 0, 1                                             |
|                       | BWP indicator                       | 0                                             | 0-2[fn:6]                                        |
|                       | Frequency domain allocation[fn:9]   | Only type 1 resource allocation is supported. |                                                  |
|                       | Time domain allocation              | 1-4                                           | 1-4                                              |
|                       | Frequency hopping[fn:21]            | 0, 1                                          | 0, 1                                             |
| TB related            | MCS                                 | 5                                             | 5                                                |
|                       | NDI                                 | 1                                             | 1                                                |
|                       | RV                                  | 2                                             | 2                                                |
| HARQ related          | Process number                      | 4                                             | 4                                                |
|                       | DAI[fn:19]                          | 0                                             |                                                  |
|                       | CBGTI                               | 0                                             | 0, 2, 4, 6[fn:12]                                |
| Multi-antenna related | DMRS sequence initialization        | 0                                             | 1[fn:15]                                         |
|                       | Antenna ports                       | 0                                             | 2-5                                              |
|                       | SRS resource indicator (SRI)[fn:13] | 0                                             | Depend on the number of SRS groups configured,   |
|                       |                                     |                                               | and codebook-based/non-codebook-based precoding. |
|                       | Precoding information[fn:23]        | 0                                             | 0-6[fn:22]                                       |
|                       | PTRS-DMRS association               | 0                                             | 0, 2[fn:24]                                      |
|                       | SRS request                         | 0                                             | 2[fn:16]                                         |
|                       | CSI request                         | 0                                             | 0-6[fn:25]                                       |
| Power control         | PUSCH power control                 |                                               | 2                                                |
|                       | Beta offset                         | 0                                             | 0, 2[fn:26]                                            |
** Slot format indication (DCI format 2-0)
DCI format 2-0 is used to signal the SFI which is scrambled by SFI-RNTI and common to a severality of UE's.
** Preemption indication (DCI format 2-1)
DCI format 2-1 is used to signal the preemption indicator to a UE, which is scrambled by INT-RNTI and common to multiple UE's.
** Uplink power control commands (DCI format 2-2)
As a complement to the power control commands, DCI format 2-2 aims to support power control for semipersistent scheduling. For the purpose of reducing the number of blind decoding attempts, its size is aligned with the size of the fallback DCI formats, i.e., DCI formats 0-0 and 1-0.
** SRS control commands (DCI format 2-3)
DCI format 2-3 is proposed for power control of SRS, which is decoupled with the power control for PUSCH.
* Signalling of frequency domain resources
The frequency-domain resource allocation fields indicate the resource blocks in the active BWP. Regarding the indication, there are a couple of methods, termed /type-0/ and /type-1/ respectively. The former is based on a bitmap, and will bring about large signaling overhead. While the latter covers the a starting position in the frequency domain and an amount of resources.

The resource allocation scheme can be configured as type-0, type-1, and dynamic selection between the both[fn:27]. Note that the allocation is indicated in the term of VRB. For type-0, each VRB is directly mapped to a PRB without interleaving. For type-1, there are two alternatives for the VRB-to-PRB mapping, interleaved and non-interleaved.

Generally, many transmission parameters are per-BWP configured. The information obtained are based on the current BWP, which should be transformed and translated before applied to the target BWP by padding/truncating for each DCI field.
