nr_dci.html
<div id="outline-container-orgf3cf749" class="outline-3">
<h3 id="orgf3cf749">Uplink scheduling grants (DCI formats 0-0 and 0-1)</h3>
<div class="outline-text-3" id="text-orgf3cf749">
<p>
Similar to downlink scheduling assignments, uplink scheduling grants also use one of DCI formats, the non-fallback format, i.e., DCI format 0-1, and the fallback format, i.e., DCI format 0-0. Aiming to reduce the number of blind decoding, the non-fallback DCI formats for downlink scheduling assignments (format 1-1) and uplink scheduling grants (format 0-1) are aligned by padding to the smaller one.
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Class</th>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">Format 0-0 (bits)</th>
<th scope="col" class="org-left">Format 0-1 (bits)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Format identifier</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1</td>
<td class="org-left">1</td>
</tr>

<tr>
<td class="org-left">Resource related</td>
<td class="org-left">CFI</td>
<td class="org-left">0</td>
<td class="org-left">0, 3<sup><a id="fnr.5.100" class="footref" href="#fn.5">5</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">UL/SUL<sup><a id="fnr.18" class="footref" href="#fn.18">18</a></sup></td>
<td class="org-left">0, 1</td>
<td class="org-left">0, 1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">BWP indicator</td>
<td class="org-left">0</td>
<td class="org-left">0-2<sup><a id="fnr.6.100" class="footref" href="#fn.6">6</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Frequency domain allocation<sup><a id="fnr.7.100" class="footref" href="#fn.7">7</a></sup></td>
<td class="org-left">Only type 1 resource allocation is supported.</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Time domain allocation</td>
<td class="org-left">1-4</td>
<td class="org-left">1-4</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Frequency hopping<sup><a id="fnr.19" class="footref" href="#fn.19">19</a></sup></td>
<td class="org-left">0, 1</td>
<td class="org-left">0, 1</td>
</tr>

<tr>
<td class="org-left">TB related</td>
<td class="org-left">MCS</td>
<td class="org-left">5</td>
<td class="org-left">5</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">NDI</td>
<td class="org-left">1</td>
<td class="org-left">1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">RV</td>
<td class="org-left">2</td>
<td class="org-left">2</td>
</tr>

<tr>
<td class="org-left">HARQ related</td>
<td class="org-left">Process number</td>
<td class="org-left">4</td>
<td class="org-left">4</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">DAI<sup><a id="fnr.20" class="footref" href="#fn.20">20</a></sup></td>
<td class="org-left">0</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">CBGTI</td>
<td class="org-left">0</td>
<td class="org-left">0, 2, 4, 6<sup><a id="fnr.12.100" class="footref" href="#fn.12">12</a></sup></td>
</tr>

<tr>
<td class="org-left">Multi-antenna related</td>
<td class="org-left">DMRS sequence initialization</td>
<td class="org-left">0</td>
<td class="org-left">1<sup><a id="fnr.15.100" class="footref" href="#fn.15">15</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Antenna ports</td>
<td class="org-left">0</td>
<td class="org-left">2-5</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">SRS resource indicator (SRI)<sup><a id="fnr.21" class="footref" href="#fn.21">21</a></sup></td>
<td class="org-left">0</td>
<td class="org-left">Depend on the number of SRS groups configured,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">and codebook-based/non-codebook-based precoding.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Precoding information<sup><a id="fnr.22" class="footref" href="#fn.22">22</a></sup></td>
<td class="org-left">0</td>
<td class="org-left">0-6<sup><a id="fnr.23" class="footref" href="#fn.23">23</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">PTRS-DMRS association</td>
<td class="org-left">0</td>
<td class="org-left">0, 2<sup><a id="fnr.24" class="footref" href="#fn.24">24</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">SRS request</td>
<td class="org-left">0</td>
<td class="org-left">2<sup><a id="fnr.14.100" class="footref" href="#fn.14">14</a></sup></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">CSI request</td>
<td class="org-left">0</td>
<td class="org-left">0-6<sup><a id="fnr.25" class="footref" href="#fn.25">25</a></sup></td>
</tr>

<tr>
<td class="org-left">Power control</td>
<td class="org-left">PUSCH power control</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Beta offset</td>
<td class="org-left">0</td>
<td class="org-left">0, 2<sup><a id="fnr.26" class="footref" href="#fn.26">26</a></sup></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org4287975" class="outline-3">
<h3 id="org4287975">Slot format indication (DCI format 2-0)</h3>
<div class="outline-text-3" id="text-org4287975">
<p>
DCI format 2-0 is used to signal the SFI which is scrambled by SFI-RNTI and common to a severality of UE's.
</p>
</div>
</div>
<div id="outline-container-orgf5d2639" class="outline-3">
<h3 id="orgf5d2639">Preemption indication (DCI format 2-1)</h3>
<div class="outline-text-3" id="text-orgf5d2639">
<p>
DCI format 2-1 is used to signal the preemption indicator to a UE, which is scrambled by INT-RNTI and common to multiple UE's.
</p>
</div>
</div>
<div id="outline-container-orge3f4adc" class="outline-3">
<h3 id="orge3f4adc">Uplink power control commands (DCI format 2-2)</h3>
<div class="outline-text-3" id="text-orge3f4adc">
<p>
As a complement to the power control commands, DCI format 2-2 aims to support power control for semipersistent scheduling. For the purpose of reducing the number of blind decoding attempts, its size is aligned with the size of the fallback DCI formats, i.e., DCI formats 0-0 and 1-0.
</p>
</div>
</div>
<div id="outline-container-org4a092c3" class="outline-3">
<h3 id="org4a092c3">SRS control commands (DCI format 2-3)</h3>
<div class="outline-text-3" id="text-org4a092c3">
<p>
DCI format 2-3 is proposed for power control of SRS, which is decoupled with the power control for PUSCH.
</p>
</div>
</div>
</div>
<div id="outline-container-org7fd8ede" class="outline-2">
<h2 id="org7fd8ede">Signalling of frequency domain resources</h2>
<div class="outline-text-2" id="text-org7fd8ede">
<p>
The frequency-domain resource allocation fields indicate the resource blocks in the active BWP. Regarding the indication, there are a couple of methods, termed <i>type-0</i> and <i>type-1</i> respectively. The former is based on a bitmap, and will bring about large signaling overhead. While the latter covers the a starting position in the frequency domain and an amount of resources.
</p>

<p>
The resource allocation scheme can be configured as type-0, type-1, and dynamic selection between the both<sup><a id="fnr.27" class="footref" href="#fn.27">27</a></sup>. Note that the allocation is indicated in the term of VRB. For type-0, each VRB is directly mapped to a PRB without interleaving. For type-1, there are two alternatives for the VRB-to-PRB mapping, interleaved and non-interleaved.
</p>

<p>
Generally, many transmission parameters are per-BWP configured. The information obtained are based on the current BWP, which should be transformed and translated before applied to the target BWP by padding/truncating for each DCI field.
</p>
</div>
</div>
