nr_dci.org
* Signalling of time domain resources
The time domain allocation field in DCI is essentially an entry index of the corresponding table. Totally two tables are configured by RRC signalling, for downlink scheduling assignment and uplink scheduling grant respectively. A table has up to 16 entries, with each entry consisting of
- A /slot offset/ relative to the DCI belonging slot
- The starting OFDM symbol for data transmission
- The number of OFDM symbols in the slot
- For downlink, the PDSCH mapping type.

/Slot aggregation/ is a tool for coverage enhancement, in which a TB is repeated across up to 8 slots. The related configuration is separately signalled by RRC signalling.
* Signalling of TB size
Regarding TB size determination, NR adopts a hybrid method. For smaller TB, NR defines a table to lookup. While for larger TB, the TB size can be computed based on a formula.

Considering the 5-bit MCS field, there are 32 combinations. Depending on whether 256QAM is supported or not, there are 28 or 29 MCS levels and the other 4[fn:28] or 3[fn:29] are reserved for retransmission.

According to the indication of the scheduled resources, the number of RE's available can be obtained. By subtracting the RE's for DMRS, and CSI-RS/SRS, the number of RE's available for data transmission can be further acquired. According to the spectral efficiency indicated by MCS, an intermediate number of information bits can be got whereby table lookup or formula-based computation can be carried out. After that, the TB size can be determined.

For retransmission, the TB size is equal to that for initial transmission. Based on the modulation order indicated by the reserved MCS level, the code rate can be implicitly derived.

* Footnotes

[fn:29]Corresponding to QPSK, 16QAM, and 64QAM.

[fn:28]Corresponding to QPSK, 16QAM, 64QAM, and 256QAM. 

[fn:27]Using 1 bit in DCI.

[fn:26]Control the amount of resources for UCI on PUSCH in case dynamic beta offset signalling is configured. 

[fn:25]Request transmission of a CSI report. 

[fn:24]Indicate the association between DMRS and PTRS ports. 

[fn:23]Select the precoding matrix and the number of layers for codebook-based precoding. 

[fn:22]Depend on the number of antenna ports and the maximum rank supported. 

[fn:13]Determine the antenna ports and uplink transmission beam to PUSCH. 

[fn:19]Handling of HARQ codebooks in case of UCI transmitted on PUSCH.

[fn:21]Handle frequency hopping for type 1 resource allocation.

[fn:20]Present only when a supplementary uplink is configured. 

[fn:18]Select the PUCCH resource from a set of configured resources. 

[fn:17]Adjust PUCCH transmission power. 

[fn:16]Request a SRS transmission. 

[fn:15]Select between two preconfigured initialization values for the DMRS sequence. 

[fn:14]Indicate the QCL relationship for downlink transmission. 

[fn:12]Only if CBG retransmission is configured. 

[fn:11]Indicate when HARQ acknowledgement should be transmitted relative to the reception of the PDSCH.

[fn:10]Depend on a second TB's presence.

[fn:9]Depend on bandwidth and resource allocation type of the current active BWP, not the target BWP. 

[fn:8]Present only when resource allocation type 1 is used. 

[fn:7]Indicate whether the reserved resources can be used for PDSCH or not. 

[fn:6]Used to activate one of up to 4 BWP's configured by higher layer signalling. 

[fn:5]Present only when cross carrier scheduling is configured. 

[fn:4]In LTE, the aggregation level can only be 1, 2, 4, 8. 

[fn:3]In NR, in order to reduce the complexity of blind DCI decoding at UE's, some DCI formats are aligned with identical size.

[fn:2]Within a REG, on every 4th subcarrier there is a DMRS RE.

[fn:1]Rate matching is used to match the number of coded bits to the resources available for PDCCH transmission, e.g., shortening, puncturing or repetition.
