nr_dci.html
<div id="outline-container-orgcd995d8" class="outline-2">
<h2 id="orgcd995d8">Signalling of time domain resources</h2>
<div class="outline-text-2" id="text-orgcd995d8">
<p>
The time domain allocation field in DCI is essentially an entry index of the corresponding table. Totally two tables are configured by RRC signalling, for downlink scheduling assignment and uplink scheduling grant respectively. A table has up to 16 entries, with each entry consisting of
</p>
<ul class="org-ul">
<li>A <i>slot offset</i> relative to the DCI belonging slot</li>
<li>The starting OFDM symbol for data transmission</li>
<li>The number of OFDM symbols in the slot</li>
<li>For downlink, the PDSCH mapping type.</li>
</ul>

<p>
<i>Slot aggregation</i> is a tool for coverage enhancement, in which a TB is repeated across up to 8 slots. The related configuration is separately signalled by RRC signalling.
</p>
</div>
</div>
<div id="outline-container-org537a19b" class="outline-2">
<h2 id="org537a19b">Signalling of TB size</h2>
<div class="outline-text-2" id="text-org537a19b">
<p>
Regarding TB size determination, NR adopts a hybrid method. For smaller TB, NR defines a table to lookup. While for larger TB, the TB size can be computed based on a formula.
</p>

<p>
Considering the 5-bit MCS field, there are 32 combinations. Depending on whether 256QAM is supported or not, there are 28 or 29 MCS levels and the other 4<sup><a id="fnr.28" class="footref" href="#fn.28">28</a></sup> or 3<sup><a id="fnr.29" class="footref" href="#fn.29">29</a></sup> are reserved for retransmission.
</p>

<p>
According to the indication of the scheduled resources, the number of RE's available can be obtained. By subtracting the RE's for DMRS, and CSI-RS/SRS, the number of RE's available for data transmission can be further acquired. According to the spectral efficiency indicated by MCS, an intermediate number of information bits can be got whereby table lookup or formula-based computation can be carried out. After that, the TB size can be determined.
</p>

<p>
For retransmission, the TB size is equal to that for initial transmission. Based on the modulation order indicated by the reserved MCS level, the code rate can be implicitly derived.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Rate matching is used to match the number of coded bits to the resources available for PDCCH transmission, e.g., shortening, puncturing or repetition.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
Within a REG, on every 4th subcarrier there is a DMRS RE.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
In LTE, the aggregation level can only be 1, 2, 4, 8. 
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
In NR, in order to reduce the complexity of blind DCI decoding at UE's, some DCI formats are aligned with identical size.
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
Present only when cross carrier scheduling is configured. 
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
Used to activate one of up to 4 BWP's configured by higher layer signalling. 
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> <div class="footpara"><p class="footpara">
Depend on bandwidth and resource allocation type of the current active BWP, not the target BWP. 
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8">8</a></sup> <div class="footpara"><p class="footpara">
Present only when resource allocation type 1 is used. 
</p></div></div>

<div class="footdef"><sup><a id="fn.9" class="footnum" href="#fnr.9">9</a></sup> <div class="footpara"><p class="footpara">
Indicate whether the reserved resources can be used for PDSCH or not. 
</p></div></div>

<div class="footdef"><sup><a id="fn.10" class="footnum" href="#fnr.10">10</a></sup> <div class="footpara"><p class="footpara">
Depend on a second TB's presence.
</p></div></div>

<div class="footdef"><sup><a id="fn.11" class="footnum" href="#fnr.11">11</a></sup> <div class="footpara"><p class="footpara">
Indicate when HARQ acknowledgement should be transmitted relative to the reception of the PDSCH.
</p></div></div>

<div class="footdef"><sup><a id="fn.12" class="footnum" href="#fnr.12">12</a></sup> <div class="footpara"><p class="footpara">
Only if CBG retransmission is configured. 
</p></div></div>

<div class="footdef"><sup><a id="fn.13" class="footnum" href="#fnr.13">13</a></sup> <div class="footpara"><p class="footpara">
Indicate the QCL relationship for downlink transmission. 
</p></div></div>

<div class="footdef"><sup><a id="fn.14" class="footnum" href="#fnr.14">14</a></sup> <div class="footpara"><p class="footpara">
Request a SRS transmission. 
</p></div></div>

<div class="footdef"><sup><a id="fn.15" class="footnum" href="#fnr.15">15</a></sup> <div class="footpara"><p class="footpara">
Select between two preconfigured initialization values for the DMRS sequence. 
</p></div></div>

<div class="footdef"><sup><a id="fn.16" class="footnum" href="#fnr.16">16</a></sup> <div class="footpara"><p class="footpara">
Adjust PUCCH transmission power. 
</p></div></div>

<div class="footdef"><sup><a id="fn.17" class="footnum" href="#fnr.17">17</a></sup> <div class="footpara"><p class="footpara">
Select the PUCCH resource from a set of configured resources. 
</p></div></div>

<div class="footdef"><sup><a id="fn.18" class="footnum" href="#fnr.18">18</a></sup> <div class="footpara"><p class="footpara">
Present only when a supplementary uplink is configured. 
</p></div></div>

<div class="footdef"><sup><a id="fn.19" class="footnum" href="#fnr.19">19</a></sup> <div class="footpara"><p class="footpara">
Handle frequency hopping for type 1 resource allocation.
</p></div></div>

<div class="footdef"><sup><a id="fn.20" class="footnum" href="#fnr.20">20</a></sup> <div class="footpara"><p class="footpara">
Handling of HARQ codebooks in case of UCI transmitted on PUSCH.
</p></div></div>

<div class="footdef"><sup><a id="fn.21" class="footnum" href="#fnr.21">21</a></sup> <div class="footpara"><p class="footpara">
Determine the antenna ports and uplink transmission beam to PUSCH. 
</p></div></div>

<div class="footdef"><sup><a id="fn.22" class="footnum" href="#fnr.22">22</a></sup> <div class="footpara"><p class="footpara">
Select the precoding matrix and the number of layers for codebook-based precoding. 
</p></div></div>

<div class="footdef"><sup><a id="fn.23" class="footnum" href="#fnr.23">23</a></sup> <div class="footpara"><p class="footpara">
Depend on the number of antenna ports and the maximum rank supported. 
</p></div></div>

<div class="footdef"><sup><a id="fn.24" class="footnum" href="#fnr.24">24</a></sup> <div class="footpara"><p class="footpara">
Indicate the association between DMRS and PTRS ports. 
</p></div></div>

<div class="footdef"><sup><a id="fn.25" class="footnum" href="#fnr.25">25</a></sup> <div class="footpara"><p class="footpara">
Request transmission of a CSI report. 
</p></div></div>

<div class="footdef"><sup><a id="fn.26" class="footnum" href="#fnr.26">26</a></sup> <div class="footpara"><p class="footpara">
Control the amount of resources for UCI on PUSCH in case dynamic beta offset signalling is configured. 
</p></div></div>

<div class="footdef"><sup><a id="fn.27" class="footnum" href="#fnr.27">27</a></sup> <div class="footpara"><p class="footpara">
Using 1 bit in DCI.
</p></div></div>

<div class="footdef"><sup><a id="fn.28" class="footnum" href="#fnr.28">28</a></sup> <div class="footpara"><p class="footpara">
Corresponding to QPSK, 16QAM, 64QAM, and 256QAM. 
</p></div></div>

<div class="footdef"><sup><a id="fn.29" class="footnum" href="#fnr.29">29</a></sup> <div class="footpara"><p class="footpara">
Corresponding to QPSK, 16QAM, and 64QAM.
</p></div></div>


</div>
</div></div>
</body>
</html>
